solution_verification/simplified_edds_model/solver_tolerance_study/simulation_setup/template/constant/caseSolid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/caseSolid";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
	nMoles          1;
        molWeight       58.693; // Molecular Weight of Nickel
    }
    thermodynamics
    {
        Cp              444;    // Heat Capacity of Nickel
        Cv		444;
        Hf              0;
    }
    transport
    {
        kappa           91;    // Thermal Conductivity of Nickel
    }
    equationOfState
    {
	rho             8900;  // Density of Nickel
    }
}








// ************************************************************************* //

